app/Controllers/LoginUsersController.php

    public function auth()
    {
        $error = 1;

        $session = session();
        $model = new Users();

        $usermail = $this->request->getVar('authusem');
        $password = $this->request->getVar('authpass');

        $data = $model->where('username', $usermail)->orWhere('email', $usermail)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin@admin.com'
OR `email` = 'admin@admin.com'
 LIMIT 1